In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pylab as plt

In [ ]:
# merge and join - pd.merge() conditions sabai bracket bhitra huncha

In [ ]:
df1 = pd.DataFrame(
    {
        "employee": ["Bob", "Jake", "Lisa", "Sue"],
        "group": ["Accounting", "Engineering", "Engineering", "HR"],
    }
)

df2 = pd.DataFrame(
    {
        "employee": ["Lisa", "Bob", "Jake", "Sue"],
        "hire_date": [2004, 2008, 2011, 2009],
    }
)

print(df1)
print("-" * 20)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2011
3      Sue       2009

In [ ]:
df3 = pd.merge(df1, df2)
print(df3)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2011
2     Lisa  Engineering       2004
3      Sue           HR       2009

In [ ]:
df4 = pd.DataFrame(
    {
        "group": ["Accounting", "Engineering", "HR"],
        "supervisor": ["Carly", "Guido", "Steve"],
    }
)
print(df3)
print("-" * 20)
print(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2011
2     Lisa  Engineering       2004
3      Sue           HR       2009
--------------------
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [ ]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2011      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2009      Steve

In [ ]:
pd.merge(df4, df3)

         group supervisor employee  hire_date
0   Accounting      Carly      Bob       2008
1  Engineering      Guido     Jake       2011
2  Engineering      Guido     Lisa       2004
3           HR      Steve      Sue       2009

In [ ]:
df5 = pd.DataFrame(
    {
        "group": ["Accounting", "Accounting", "Engineering", "Engineering", "HR", "HR"],
        "skills": [
            "math",
            "spreadsheets",
            "coding",
            "linux",
            "spreadsheets",
            "organization",
        ],
    }
)

print(df5)

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [ ]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [ ]:
# specifications in merge

In [ ]:
print(df1)
print("-" * 20)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2011
3      Sue       2009

In [ ]:
pd.merge(df1, df2, on="employee")

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2011
2     Lisa  Engineering       2004
3      Sue           HR       2009

In [ ]:
df6 = pd.DataFrame(
    {"name": ["Bob", "Jake", "Lisa", "Sue"], "salary": [70000, 80000, 120000, 90000]}
)

print(df1)
print("-" * 40)
print(df6)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
----------------------------------------
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [ ]:
pd.merge(df1, df6, left_on="employee", right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [ ]:
pd.merge(df1, df6, left_on="employee", right_on="name").drop("name", axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [ ]:
# name same cha so drop garda huncha

In [ ]:
df1a = df1.set_index("employee")
df2a = df2.set_index("employee")

In [ ]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [ ]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2011
Sue            2009

In [ ]:
df7 = pd.DataFrame(
    {"name": ["peter", "paul", "mary"], "food": ["fish", "beans", "bread"]},
    columns=["name", "food"],
)

df8 = pd.DataFrame(
    {"name": ["mary", "joseph"], "drink": ["wine", "beer"]},
    columns=["name", "drink"],
)

In [ ]:
pd.merge(df7, df8)

   name   food drink
0  mary  bread  wine

In [ ]:
pd.merge(df7, df8, how="inner")

   name   food drink
0  mary  bread  wine

In [ ]:
pd.merge(df7, df8, how="outer")

     name   food drink
0  joseph    NaN  beer
1    mary  bread  wine
2    paul  beans   NaN
3   peter   fish   NaN

In [ ]:
pd.merge(df7, df8, how="left")

    name   food drink
0  peter   fish   NaN
1   paul  beans   NaN
2   mary  bread  wine

In [ ]:
pd.merge(df7, df8, how="right")

     name   food drink
0    mary  bread  wine
1  joseph    NaN  beer

In [ ]:
# outer is union, inner is intersection

In [ ]:
# left le left ko table ko primary key hercha and same for right

In [ ]:
df9 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], "rank": [1, 2, 3, 4]})

df10 = pd.DataFrame({"name": ["Bob", "Jake", "Lisa", "Sue"], "rank": [2, 1, 3, 4]})

pd.merge(df9, df10, on="name")

   name  rank_x  rank_y
0   Bob       1       2
1  Jake       2       1
2  Lisa       3       3
3   Sue       4       4

In [ ]:
pd.merge(df9, df10, on="name", suffixes=["_left", "_right"])

   name  rank_left  rank_right
0   Bob          1           2
1  Jake          2           1
2  Lisa          3           3
3   Sue          4           4

In [ ]:
# download state population data
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0  65703      0 --:--:-- --:--:-- --:--:-- 65910

In [ ]:
# download state areas data
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0   1239      0 --:--:-- --:--:-- --:--:--  1244

In [ ]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0   1461      0 --:--:-- --:--:-- --:--:--  1465
100   872  100   872    0     0   1459      0 --:--:-- --:--:-- --:--:--  1465

In [ ]:
pop = pd.read_csv('state-population.csv')

In [ ]:
areas = pd.read_csv('state-areas.csv')

In [ ]:
abbrevs = pd.read_csv('state-abbrevs.csv')

In [ ]:
print(pop.head())
print("-" * 40)
print(areas.head())
print("-" * 40)
print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
----------------------------------------
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
----------------------------------------
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [ ]:
merged = pd.merge(
    pop, abbrevs, how="outer", left_on="state/region", right_on="abbreviation"
)
merged = merged.drop(columns="abbreviation")
print(merged)

     state/region     ages  year  population    state
0              AK    total  1990    553290.0   Alaska
1              AK  under18  1990    177502.0   Alaska
2              AK    total  1992    588736.0   Alaska
3              AK  under18  1991    182180.0   Alaska
4              AK  under18  1992    184878.0   Alaska
...           ...      ...   ...         ...      ...
2539           WY  under18  1993    137458.0  Wyoming
2540           WY    total  1991    459260.0  Wyoming
2541           WY  under18  1991    136720.0  Wyoming
2542           WY  under18  1990    136078.0  Wyoming
2543           WY    total  1990    453690.0  Wyoming

[2544 rows x 5 columns]

In [ ]:
merged1 = pd.merge(
    pop, abbrevs, how="inner", left_on="state/region", right_on="abbreviation"
)
print(merged1)

     state/region     ages  year  population    state abbreviation
0              AL  under18  2012   1117489.0  Alabama           AL
1              AL    total  2012   4817528.0  Alabama           AL
2              AL  under18  2010   1130966.0  Alabama           AL
3              AL    total  2010   4785570.0  Alabama           AL
4              AL  under18  2011   1125763.0  Alabama           AL
...           ...      ...   ...         ...      ...          ...
2443           WY  under18  1993    137458.0  Wyoming           WY
2444           WY    total  1991    459260.0  Wyoming           WY
2445           WY  under18  1991    136720.0  Wyoming           WY
2446           WY  under18  1990    136078.0  Wyoming           WY
2447           WY    total  1990    453690.0  Wyoming           WY

[2448 rows x 6 columns]

In [ ]:
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [ ]:
merged.isnull().any()  # any le chai tyo column ma cha ki chaina vanera dekhaucha

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool